---
kind: property
id: P:Autodesk.Revit.ApplicationServices.Application.CurrentUsersAddinsDataFolderPath
source: html/eb8bec74-4ff6-fcd9-2dc5-a93f41db3979.htm
---
# Autodesk.Revit.ApplicationServices.Application.CurrentUsersAddinsDataFolderPath Property

Path to AddinsData folder for the current user.

## Syntax (C#)
```csharp
public string CurrentUsersAddinsDataFolderPath { get; }
```

## Remarks
Similar to C:\Users\[UserName]\AppData\Roaming\Autodesk\[ProductType]\[ReleaseName]\AddinsData